Autodesk.Revit.DB.ExportLineweightTable.Remove(Autodesk.Revit.DB.ExportLineweightKey)
Removes the pair (key, info) corresponding to the given ExportLineweightKey.
exportLineweightKey:
The export line weight key
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ExportLineweightTable.Add(Autodesk.Revit.DB.ExportLineweightKey,Autodesk.Revit.DB.ExportLineweightInfo)
Inserts a (key, info) pair into Export line weight table.
exportLineweightKey:
The export line weight Key to be added.
exportLineweightInfo:
The export line weight info to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The key already exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ExportLineweightTable.GetExportLineweightInfo(Autodesk.Revit.DB.ExportLineweightKey)
Gets a copy of the ExportLineweightInfo corresponding to the given ExportLineweightKey.
exportLineweightKey:
The export line weight Key.
Returns:
Returns the line weight info for this key.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An entry with the given key is not present in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ExportLineweightTable.ContainsKey(Autodesk.Revit.DB.ExportLineweightKey)
Checks whether a line weight key exists in the table.
exportLineweightKey:
The export line weight key.
Returns:
True if the line weight exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.ExportLineweightTable
A table supporting a mapping of line weights in Revit to line weight names that will be set
in the target export format.
Remarks:
This table is structured as a mapping from Autodesk.Revit.DB.ExportLineweightKey to
Autodesk.Revit.DB.ExportLineweightInfo members.  The Autodesk.Revit.DB.ExportLineweightKey
contains the identification information for the pattern table: the Revit line weight.  The
Autodesk.Revit.DB.ExportLineweightInfo contains the line weight to use in the export format.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys
obtained from GetKeys(), or via specific lookup of a key constructed externally.  In all cases, the
Autodesk.Revit.DB.ExportLineweightInfo returned will be a copy of the Autodesk.Revit.DB.ExportLineweightInfo
from the table.  In order to make changes to the Autodesk.Revit.DB.ExportLineweightInfo and use those settings during export,
set the modified Autodesk.Revit.DB.ExportLineweightInfo back into the table using the same key.

Autodesk.Revit.DB.ExportLineweightTable.Item(Autodesk.Revit.DB.ExportLineweightKey)
A copy of the Autodesk.Revit.DB.ExportLineweightInfo for the line weight's Autodesk.Revit.DB.ExportLineweightKey.
Remarks:
When getting this property, it returns a copy of the Autodesk.Revit.DB.ExportLineweightInfo from the table.  In order to
make changes to the Autodesk.Revit.DB.ExportLineweightInfo and use those settings during export, set the modified
Autodesk.Revit.DB.ExportLineweightInfo back into the table using the same key.
ExportLineweightKey:
The key.
Returns:
A copy of the Autodesk.Revit.DB.ExportLineweightInfo.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When getting this property:
An entry with the given key is not present in the table.
Since:
2014